Управление_торговлей.ПБТ/src/Documents/вт_НачислениеЗарплаты/вт_НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>вт_НачислениеЗарплаты</name>
  <registerRecords>AccumulationRegister.вт_НачислениеЗарплаты</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>МесяцНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНачисления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеВыработки</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Основание</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.ВидыНоменклатуры</types>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/AccumulationRegisters/вт_ВыработкаСотрудников/вт_ВыработкаСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>вт_ВыработкаСотрудников</name>
  <comment>Результаты выработки по итогам ввода отчетов производства. Является основанием для начисления зарплаты</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ВидыНоменклатуры</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_торговлей.ПБТ/src/Documents/вт_НачислениеЗарплаты/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура МесяцНачисленияПриИзменении(Элемент)
	Объект.МесяцНачисления = НачалоМесяца(Объект.МесяцНачисления);
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьПоВыработкеЗаПериодНаСервере()

 Запрос = Новый Запрос("ВЫБРАТЬ
                       |	вт_ВыработкаСотрудников.Сотрудник КАК Сотрудник,
                       |	СУММА(вт_ВыработкаСотрудников.Сумма) КАК Сумма,
                       |	вт_ВыработкаСотрудников.Основание КАК Основание
                       |ИЗ
                       |	РегистрНакопления.вт_ВыработкаСотрудников КАК вт_ВыработкаСотрудников
                       |ГДЕ
                       |	вт_ВыработкаСотрудников.Период МЕЖДУ &НачалоПериода И &КонецПериода
                       |	И вт_ВыработкаСотрудников.Организация = &Организация
                       |	И (вт_ВыработкаСотрудников.Подразделение = &Подразделение
                       |			ИЛИ &Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
                       |
                       |СГРУППИРОВАТЬ ПО
                       |	вт_ВыработкаСотрудников.Сотрудник,
                       |	вт_ВыработкаСотрудников.Основание
                       |ИТОГИ
                       |	СУММА(Сумма)
                       |ПО
                       |	Сотрудник");
 
 //   
 //Запрос = Новый Запрос("ВЫБРАТЬ
 //                      |	вт_ВыработкаСотрудников.Сотрудник КАК Сотрудник,
 //                      |	СУММА(вт_ВыработкаСотрудников.Сумма) КАК Сумма
 //                      |ИЗ
 //                      |	РегистрНакопления.вт_ВыработкаСотрудников КАК вт_ВыработкаСотрудников
 //                      |ГДЕ
 //                      |	вт_ВыработкаСотрудников.Период МЕЖДУ &НачалоПериода И &КонецПериода
 //                      |	И вт_ВыработкаСотрудников.Организация = &Организация
 //                      |	И (вт_ВыработкаСотрудников.Подразделение = &Подразделение
 //                      |			ИЛИ &Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
 //                      |
 //                      |СГРУППИРОВАТЬ ПО
 //                      |	вт_ВыработкаСотрудников.Сотрудник");
 //
 Запрос.УстановитьПараметр("Организация",Объект.Организация);
 Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.МесяцНачисления));
 Запрос.УстановитьПараметр("КонецПериода",КонецМесяца(Объект.МесяцНачисления));
 Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
 
 
 Объект.Начисления.Очистить();
 Объект.ДанныеВыработки.Очистить();
 
 ВыборкаСотрудники = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
 
 Пока ВыборкаСотрудники.Следующий() Цикл
	 СтрокаНачисления = Объект.Начисления.Добавить();
	 СтрокаНачисления.ФизическоеЛицо = ВыборкаСотрудники.Сотрудник;
	 СтрокаНачисления.СуммаНачисления = ВыборкаСотрудники.Сумма;
	 
	 ВыборкаДетальные = ВыборкаСотрудники.Выбрать();
	 
	 Пока ВыборкаДетальные.Следующий() Цикл
		        СтрокаВырабокта = Объект.ДанныеВыработки.Добавить();
				СтрокаВырабокта.ФизическоеЛицо = ВыборкаДетальные.Сотрудник;
				СтрокаВырабокта.Основание      =  ВыборкаДетальные.Основание;
				СтрокаВырабокта.Сумма          =  ВыборкаДетальные.Сумма;
	 КонецЦикла;	            
 КонецЦикла;
 
 
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПоВыработкеЗаПериод(Команда)
	КомандаЗаполнитьПоВыработкеЗаПериодНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НачисленияПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.Начисления.ТекущиеДанные;
	ФизЛицо = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
	
	Если ТекДанные<>Неопределено тогда
		ФизЛицо = ТекДанные.ФизическоеЛицо;
	КонецЕсли;
	
	Элементы.ДанныеВыработки.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("ФизическоеЛицо",ФизЛицо));
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеВыработкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ТекДанные = Элементы.Начисления.ТекущиеДанные;
	ФизЛицо = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
	
	Если ТекДанные=Неопределено тогда
		Сообщить("Выберите строку в таблице начисления!");
		Отказ=Истина;
	КонецЕсли;
	
	
	ФизЛицо = ТекДанные.ФизическоеЛицо;
	Если Не ЗначениеЗаполнено(ФизЛицо) Тогда
		Сообщить("Укажите сотрудника в строке в таблице начисления!");
		Отказ=Истина;
	КонецЕсли;	
	
	Элементы.Начисления.Обновить();
	Элементы.ДанныеВыработки.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("ФизическоеЛицо",ФизЛицо));
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеВыработкиПередНачаломИзменения(Элемент, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДанныеВыработкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока ТОгда 
		ТекДанные = Элементы.Начисления.ТекущиеДанные;
		ТекДанныеВыработки = Элементы.ДанныеВыработки.ТекущиеДанные;
		ТекДанныеВыработки.ФизическоеЛицо = ТекДанные.ФизическоеЛицо;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьСуммуПоФизЛицу()
	
	ТекДанные = Элементы.Начисления.ТекущиеДанные;
	
	ФизЛицо = ТекДанные.ФизическоеЛицо;
	СуммаФизЛицо = 0;
	СтрокиПоФизЛицу = Объект.ДанныеВыработки.НайтиСтроки(Новый Структура("ФизическоеЛицо",ФизЛицо));
	Для Каждого СтрокаФИзлицо из СтрокиПоФизЛицу Цикл 
		СуммаФизЛицо = СуммаФизЛицо + СтрокаФИзлицо.Сумма;
	КонецЦикла;
	
	ТекДанные.СуммаНачисления =  СуммаФизЛицо;
	ЭтаФорма.ОбновитьОтображениеДанных();

КонецПроцедуры

&НаКлиенте
Процедура ДанныеВыработкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	 ОбновитьСуммуПоФизЛицу();
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеВыработкиПослеУдаления(Элемент)
	ОбновитьСуммуПоФизЛицу();
КонецПроцедуры

&НаКлиенте
Процедура НачисленияПередУдалением(Элемент, Отказ)
	
	
	ТекДанные = Элементы.Начисления.ТекущиеДанные;
	
	ФизЛицо = ТекДанные.ФизическоеЛицо;
	СтрокиПоФизЛицу = Объект.ДанныеВыработки.НайтиСтроки(Новый Структура("ФизическоеЛицо",ФизЛицо));
	Для Каждого СтрокаФИзлицо из СтрокиПоФизЛицу Цикл 
		Объект.ДанныеВыработки.Удалить(СтрокаФИзлицо);
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеВыработкиХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ТипЗнч(ЭтаФорма.Элементы.ДанныеВыработки.ТекущиеДанные.Основание) <> Тип("СправочникСсылка.Номенклатура") Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;	
КонецПроцедуры
